rinwado/esp8266_sample-i2c_ioexp/src/main.cpp
/**
 * タスクスケジューラーとティッカー ライブラリーを使ったスリープモード、起動時情報の取得、
 * 信号のエッジ検出、ESP WROOM 02 内部ＡＤＣの読込、ブザーのサンプルプログラム
 * for PlatformIO
 * 
 * 対応ボード：IOT Integrated Controller V1
 *            RRH-G101A REV-B
 * ボード設定：
 * deepSleep からの起床は、ＩＯ１６ポートがリセット信号に接続されている必要があります。
 * IOT Integrated Controller V1 ボードのＪＰ１を「ＲＳＴ＃」側にジャンパー。
 * IO16の初期（入力・出力の設定）は不要です。
 * 
 * 2026-03-30
 * Copyright (c) 2026 rinwado
 * Licensed under the MIT License.
 * See LICENSE file in the project root for full license text.
 */

#include <new>
#include <Arduino.h>
#include <Ticker.h>
#include <TaskScheduler.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>
#include <NTPClient.h>
#include <time.h>
#include <Wire.h>
#include <TCA9534-GPIO.h>
#include "rd_iic_s3539x.h"
#include "net_env.h"
#include "ADS1X15.h"
#include "rd_small_lcds.h"



/// 定義
#define IIC_SCL_PIN           (5)           //IIC SCL Port
#define IIC_SDA_PIN           (4)           //IIC SCL Port
#define LED_LD4               (16)          //IO port 16 に接続されている　ＬＥＤ
#define IO0_PIN               (0)           //プログラムボタンと兼用[SW2/IN1]しているので、起動時の検出はできない
#define IO2_PIN               (2)           //IN2
#define BUZZER_PIN            (13)          //ブザー制御出力　１でブザーＯＮ、０でブザーＯＦＦ
#define SW2_ISOIN1            (0x01)        //0000_0001
#define ISOIN2                (0x02)        //0000_0010
#define TCA9534_SA            (0x20)        //TCA9534 のスレーブアドレス
#define NOF_EXGPIO            (8)           //TCA9534 のGPIOの数
#define EXIOP_OUT             (false)       //TCA9534 ピンモード出力
#define EXIOP_IN              (true)        //TCA9534 ピンモード入力
#define RL1_DRV               (0)
#define RL2_DRV               (1)
#define RL3_DRV               (2)
#define RL4_DRV               (3)
#define RL1LED_DRV            (4)
#define RL2LED_DRV            (5)
#define RL3LED_DRV            (6)
#define RL4LED_DRV            (7)
#define SET_ON                (true)
#define SET_OFF               (false)

#define NOF_TICK_CNT(ms)      (ms / 3.333)  //指定したｍｓ時間が Ticker 割込みでのカウントがいくつに相当するか
#define JST_OFFSET            (9 * 3600)    //9時間 × 3600秒
#define NTP_SERVER            "ntp.nict.jp"

#define WIFI_FIXED_STR_LEN_MAX    (48)  //NULLターミネータ含めた文字数

//ネットワーク系デフォルト値
#define DEF_WIFI_AP_ID			  "def_wi-fi"
#define DEF_WIFI_AP_TK			  "def_password"
#define DEF_FIX_IP            "192.168.0.200"
#define DEF_FIX_GW            "192.168.0.254"
#define DEF_FIX_SNM           "255.255.255.0"
#define DEF_FIX_DNS           "192.168.0.254"


enum wState
{	//Wi-Fi ステート
	WIFI_CSTART = 0,
	WIFI_CLIENT_PROC_ENT,
	WIFI_CONNECT_CHK,
	WIFI_TRY_CONNECT_TO_AP,
	WIFI_CONNECT_OKNG,

  WIFI_WAIT_PROCESS,
	WIFI_OHTER_PROCESS,
};


typedef struct wifi_setting_val
{
    bool f_dhcp;
    //bool f_secure;
    char ConnectSSID[WIFI_FIXED_STR_LEN_MAX];
    char ConnectSSID_Pass[WIFI_FIXED_STR_LEN_MAX];
    IPAddress wfixIP;
    IPAddress wfixGW;
    IPAddress wfixSNM;
    IPAddress wfixDNS;
    char WiFi_mac[8];
    char WiFi_mac_str[32];
} wifi_setting_val_t;


/// プロトタイプ宣言
void IRAM_ATTR onTickTimerISR(void);
void WiFiProc_Callback(void);
void MainWork_Callback(void);
void TskOneShot_ProcCallback(void);

/// オブジェクト生成
TCA9534 exp_gpio;                         //拡張GPIO
rd_iic_s3539x RTC(IIC_DEV_CODE_S35390);   //RTC[S35390A]
ADS1115 ADS(ADS1115_ADDRESS);
rd_iic_lcds AQM1602(IIC_ADDR_AQM1602, DEVICE_IS_5V0, LCD_TYPE_AQM1602);
//rd_iic_lcds AQM1602(IIC_ADDR_AQM0802, DEVICE_IS_3V3, LCD_TYPE_AQM0802);
Ticker tick_timer1;                       //ティッカー割り込み
Scheduler TskRunner;                      //スケジューラ
//Taskの宣言した順にタスク管理リストに登録され、管理リストの順に実行タイミングがチェックされる。
//Task(周期ms, 実行回数[-1は無限], 実行する関数, スケジューラへのポインタ)
Task tsk_wifi_proc(1, TASK_FOREVER, &WiFiProc_Callback, &TskRunner);                      //[wifi_proc]タスクの作成
Task tsk_main_work(1, TASK_FOREVER, &MainWork_Callback, &TskRunner);                      //[main_work]タスクの作成
Task tsk_OneShot_01(TASK_IMMEDIATE, TASK_ONCE, &TskOneShot_ProcCallback, &TskRunner);     //[Proc]OneShotタスクの作成

/// 変数
volatile uint16_t gn_cnt1 = 0;            //汎用カウンタ１
volatile uint16_t gn_cnt2 = 0;            //汎用カウンタ２
volatile uint8_t f_FE_SignalDetect, f_RE_SignalDetect;
volatile bool f_counter_trigger = false;  //割込みカウンタによるトリガフラグ

//配列[0]:P1..配列[7]:P8
bool tca9534_PinMode[NOF_EXGPIO] = {EXIOP_OUT, EXIOP_OUT, EXIOP_OUT, EXIOP_OUT, EXIOP_OUT, EXIOP_OUT, EXIOP_OUT, EXIOP_OUT};  //TCA9534 全出力
bool tca9534_ioport[NOF_EXGPIO] = {SET_OFF, SET_OFF, SET_OFF, SET_OFF, SET_OFF, SET_OFF, SET_OFF, SET_OFF};                   //TCA9534 初期レベル HIGH, LOW
bool f_tca9534_available = false;
bool f_ads_available = false;

uint8_t act_mode = 0;


WiFiClient* WIFI_Client;
WiFiUDP* ntpUDP_Client;
NTPClient* NTP_client;
bool f_rtc_alarm[2] = {false, false};
bool f_rtc_access = false;
bool f_wifi_connected = false;
enum wState WiFi_state;
enum wState WiFi_next_state;
wifi_setting_val_t wifi_setting;

int16_t wait_time;
volatile int16_t WiFi_wait_counter;
volatile int16_t WiFi_ConnectTimeOut_Counter;
char wifi_macAddress[16];

struct tm* p_timeInfo;

/**
 * @brief Arduino setup
 * 
 */
void setup()
{
  //--- IOピン出力設定
  digitalWrite(BUZZER_PIN, LOW);  //BuzzerをOFF
  digitalWrite(LED_LD4, HIGH);    //LED-LD4をON
  //--- IOピン設定
  pinMode(BUZZER_PIN, OUTPUT);    //リセットからこのコードが実行されるまでの間ブザーが鳴ります。実行されればブザーＯＦＦ）
  pinMode(LED_LD4, OUTPUT);
  pinMode(IO0_PIN, INPUT);
  pinMode(IO2_PIN, INPUT);

  //--- シリアル
  Serial.begin(115200);
  Serial.printf_P(PSTR("\r\n[i] Flash Real Size: %u bytes\r\n"), ESP.getFlashChipRealSize()); //ESP8266に搭載されているフラッシュメモリ容量

  //--- IIC
  Wire.begin(IIC_SDA_PIN, IIC_SCL_PIN);
  Wire.setClock(100000);  //Speed 100k

  //--- TCA9534
  if(exp_gpio.begin(Wire, TCA9534_SA))
  { //成功
    Serial.printf_P(PSTR("[i] Extended GPIO is available.\r\n"));
    exp_gpio.digitalWrite(tca9534_ioport);            //ポート出力レベル設定
    exp_gpio.pinMode(tca9534_PinMode);                //ポート入出力設定
    f_tca9534_available = true;
  }
  else
  { //失敗
    Serial.printf_P(PSTR("[i] Err: Extended GPIO cannot be used!\r\n"));
    f_tca9534_available = false;
  }

  //--- S35390A
  //初期化時に、過去にアラームが発生しセットされているアラームがあるか確認している
  //ここでアラームフラグを読込むので、RTCのアラームフラグは「クリアされる」
  //つまり、Wi-Fi接続されずに、電源が切れた場合や、NTPサーバーへの接続ができなかった場合は、NTPサーバー同期がされない。
  if(0 == RTC.initialization(&f_rtc_alarm[0], &f_rtc_alarm[1]))
  {   //成功
      Serial.printf_P(PSTR("[i] S-35390A initialization ALM1=%d, ALM2=%d\r\n"), (int)f_rtc_alarm[0], (int)f_rtc_alarm[1]);
      f_rtc_access = true;
  }
  else
  {   Serial.printf_P(PSTR("[e] read err!! S-35390A data\r\n"));
      f_rtc_access = false;
  }

  //--- ADS1115
  if(ADS.begin())
  { Serial.printf_P(PSTR("ADS1x15 is available.\r\n"));
    f_ads_available = true;
  }
  else
  { Serial.printf_P(PSTR("ADS1x15 is not available.\r\n"));
    f_ads_available = false;
  }
  
  //--- LCD AQM1602(5V駆動)
  AQM1602.initialize();
  memcpy(AQM1602.lcd_data_buff[LCD_BUF_LINE1], ">>>> Rinwado ...", 16);
  memcpy(AQM1602.lcd_data_buff[LCD_BUF_LINE2], "RRH-G101A IoT-IC", 16);
  delay(300);
  AQM1602.display_update(AQM1602.lcd_data_buff[LCD_BUF_LINE1], 16, 0, AQM1602.lcd_data_buff[LCD_BUF_LINE2], 16, 0, LCD_NO_CLR, LINE_ALL);

//---
  act_mode = 0;
  WiFi_state = WIFI_CSTART;
  WiFi_next_state = WIFI_CSTART;

  WIFI_Client = NULL;
  ntpUDP_Client = NULL;
  NTP_client = NULL;

  //Wi-Fi パラメータ初期化
  f_wifi_connected = false;
  memset(wifi_setting.ConnectSSID, 0, sizeof(wifi_setting.ConnectSSID));
  strcpy(wifi_setting.ConnectSSID, WIFI_SSID);
  memset(wifi_setting.ConnectSSID_Pass, 0, sizeof(wifi_setting.ConnectSSID_Pass));
  strcpy(wifi_setting.ConnectSSID_Pass, WIFI_VERI_WORD);
  wifi_setting.wfixIP.fromString(WIFI_FIX_IP);    //IPAddress のメンバ関数[fromString]でストリングからIPアドレスに変換
  wifi_setting.wfixGW.fromString(WIFI_FIX_GW);
  wifi_setting.wfixSNM.fromString(WIFI_FIX_SNM);
  wifi_setting.wfixDNS.fromString(WIFI_FIX_DNS);

  //--- ティッカーの開始 秒数で指定(0.003333 = 3.333ms, onTimerISR関数をセット)
  tick_timer1.attach(0.003333, onTickTimerISR);
  //--- タスクを有効化
  tsk_wifi_proc.enable();
  tsk_main_work.enable();
  //tsk_OneShot_01.enable();  //TASK_ONCE　なので、ここではenableにしない
}



/**
 * @brief Arduino loop
 * 
 */
void loop()
{
  //--- スケジューラを回す
  TskRunner.execute();

