rinwado/esp8266_sample-i2c_ioexp/src/main.cpp
}



/**
 * @brief TaskScheduler コールバック関数
 *        １ｍｓ 間隔で実行される
 * Wi-Fi 処理
 */
void WiFiProc_Callback(void)
{
  static uint32_t now_free_heap_size = 0;

  switch(WiFi_state)
  {
    case WIFI_CSTART:
      f_wifi_connected = false;
      now_free_heap_size = ESP.getFreeHeap();
      Serial.printf_P(PSTR("[i] Free Heap  size: %d\r\n"), (int)now_free_heap_size);
      Serial.printf_P(PSTR("[i] WiFiClient size: %d\r\n"), (int)sizeof(WiFiClient));
      Serial.printf_P(PSTR("[i] WiFiUDP    size: %d\r\n"), (int)sizeof(WiFiUDP));
      Serial.printf_P(PSTR("[i] NTPClient  size: %d\r\n"), (int)sizeof(NTPClient));

      if(8192 < now_free_heap_size)
      { //Wi-Fi 関係で 8192byte は、通信バッハーなどでこの先利用するだろうと予測して数値を設定している
        if(NULL == WIFI_Client)
        { WIFI_Client = new WiFiClient();
          if(NULL != WIFI_Client)
          { //OK
              WiFi.mode(WIFI_STA);
              Serial.printf_P(PSTR("[i] WiFi-Mode:STA\r\n"));
          }
        }

        if(NULL == ntpUDP_Client)
        { ntpUDP_Client = new WiFiUDP();
        }

        if((NULL == NTP_client) && (NULL != ntpUDP_Client))
        { NTP_client = new NTPClient(*ntpUDP_Client, NTP_SERVER, JST_OFFSET);
        }

        if((NULL == WIFI_Client) || (NULL == ntpUDP_Client) || (NULL == NTP_client))
        { //NG
          Serial.printf_P(PSTR("[e] Failed to create the instance. Will retry in 1 second.\r\n"));
          wait_time = NOF_TICK_CNT(1000); //1000ms
          WiFi_wait_counter = 0;
          WiFi_state = WIFI_WAIT_PROCESS;
          WiFi_next_state = WIFI_CSTART;
        }
        else
        {
          now_free_heap_size = ESP.getFreeHeap();
          Serial.printf_P(PSTR("[i] Free Heap  size: %d\r\n"), (int)now_free_heap_size);            
          WiFi_state = WIFI_CLIENT_PROC_ENT;
          WiFi_next_state = WIFI_CLIENT_PROC_ENT;
        }
      }
      else
      { Serial.printf_P(PSTR("[?] There may not be enough heap memory. Will retry in 1 second.\r\n"));
        wait_time = NOF_TICK_CNT(1000); //1000ms
        WiFi_wait_counter = 0;
        WiFi_state = WIFI_WAIT_PROCESS;
        WiFi_next_state = WIFI_CSTART;
      }
    break;

    case WIFI_CLIENT_PROC_ENT:
      WiFi.disconnect(true);        //WiFi.disconnect(true, true); wifioff	trueを指定すると、ステーションモードを終了する。省略時はfalse。 eraseap	trueを指定すると、WiFiの設定情報を削除する。省略時はfalse。
      WiFi.setAutoConnect(false);		//電源再投入時に最後に接続されたAPに自動的に接続するか否か：自動接続しない
      WiFi.setAutoReconnect(false); //APの接続が切れた場合、自動的に再接続するか否か：自動接続しない（既に接続が切れている時に実行してもAPへの再接続はされない）

      if(WiFi.status() != WL_CONNECTED)
      {	//接続が切れているのを確認
        f_wifi_connected = false;
        WiFi_state = WIFI_TRY_CONNECT_TO_AP;
        WiFi_next_state = WIFI_TRY_CONNECT_TO_AP;
      }
      else
      { wait_time = NOF_TICK_CNT(50); //50ms
        WiFi_wait_counter = 0;
        WiFi_state = WIFI_WAIT_PROCESS;
        WiFi_next_state = WIFI_CLIENT_PROC_ENT;
      }
    break;     

    case WIFI_TRY_CONNECT_TO_AP:
        //ルーター（ＡＰ）への接続（WiFi.begin：デフォルトはDHCP）
        Serial.printf_P(PSTR("[i] WiFi Try connect.\r\n"));
        if(!wifi_setting.f_dhcp)
        { //DHCPでない場合
            WiFi.config(wifi_setting.wfixIP, wifi_setting.wfixGW, wifi_setting.wfixSNM, wifi_setting.wfixDNS);
        }
        WiFi.begin(wifi_setting.ConnectSSID, wifi_setting.ConnectSSID_Pass);

        WiFi_ConnectTimeOut_Counter = NOF_TICK_CNT(30000); //30s 接続タイムアウト
        WiFi_state = WIFI_CONNECT_OKNG;
        WiFi_next_state = WIFI_CONNECT_OKNG;

        now_free_heap_size = ESP.getFreeHeap();
        Serial.printf_P(PSTR("[i] Free Heap  size: %d\r\n"), (int)now_free_heap_size);   
    break;

    case WIFI_CONNECT_OKNG:
      if(WiFi.status() == WL_CONNECTED)
      {	//接続された
          WiFi.macAddress((uint8_t*)wifi_setting.WiFi_mac);
          memset(wifi_macAddress, 0, sizeof(wifi_macAddress));
          sprintf(wifi_macAddress, "%02X%02X%02X%02X%02X%02X",
                                              wifi_setting.WiFi_mac[5], wifi_setting.WiFi_mac[4], wifi_setting.WiFi_mac[3],
                                              wifi_setting.WiFi_mac[2], wifi_setting.WiFi_mac[1], wifi_setting.WiFi_mac[0]);
          sprintf(wifi_setting.WiFi_mac_str, "%02X:%02X:%02X:%02X:%02X:%02X",
                                              wifi_setting.WiFi_mac[5], wifi_setting.WiFi_mac[4], wifi_setting.WiFi_mac[3],
                                              wifi_setting.WiFi_mac[2], wifi_setting.WiFi_mac[1], wifi_setting.WiFi_mac[0]);
          Serial.printf_P(PSTR("\r\n[i] WiFi connected.\r\n"));
          Serial.printf_P(PSTR("[i] MAC address    : %s\r\n"), wifi_setting.WiFi_mac_str);
          Serial.printf_P(PSTR("[i] IP address     : %s\r\n"), WiFi.localIP().toString().c_str());
          Serial.printf_P(PSTR("[i] Default Gateway: %s\r\n"), WiFi.gatewayIP().toString().c_str());
          Serial.printf_P(PSTR("[i] Subnetmask     : %s\r\n"), WiFi.subnetMask().toString().c_str());
          Serial.printf_P(PSTR("[i] DNS Server1    : %s\r\n"), WiFi.dnsIP(0).toString().c_str());
          Serial.printf_P(PSTR("[i] DNS Server2    : %s\r\n"), WiFi.dnsIP(1).toString().c_str());

          WiFi.setAutoConnect(false);		//電源再投入時に最後に接続されたAPに自動的に接続するか否か：自動接続しない
          WiFi.setAutoReconnect(false); //APの接続が切れた場合、自動的に再接続するか否か：自動接続しない（既に接続が切れている時に実行してもAPへの再接続はされない）

          NTP_client->begin();  //NTP Client 開始

          WiFi_state = WIFI_CONNECT_CHK;
          WiFi_next_state = WIFI_CONNECT_CHK;
          f_wifi_connected = true;
          
          //LCD1.AQM0802_display_update("W", 1, 0, NULL, 0, 0, NO_OPERATION, AQM0802_L1);
      }
      else
      {	//接続タイムアウトチェック
        if(0 >= WiFi_ConnectTimeOut_Counter)
        {   //タイムアウト
          Serial.printf_P(PSTR("[i] WiFi connect timeout(30s)!\r\n"));
          wait_time = NOF_TICK_CNT(200); //200ms
          WiFi_wait_counter = 0;

          WiFi_state = WIFI_WAIT_PROCESS;
          WiFi_next_state = WIFI_CLIENT_PROC_ENT;
          f_wifi_connected = false;
        }
      }        
    break;

    case WIFI_CONNECT_CHK:
      if(WiFi.status() != WL_CONNECTED)
      {	//接続が切れた
        Serial.printf_P(PSTR("[i] Now Wi-Fi Disconnected!\r\n"));
        NTP_client->end();    //NTP Client を終了
        WIFI_Client->stop();  //TCP通信停止

        wait_time = NOF_TICK_CNT(1000); //1000ms
        WiFi_wait_counter = 0;

        WiFi_state = WIFI_WAIT_PROCESS;
        WiFi_next_state = WIFI_CLIENT_PROC_ENT;
        f_wifi_connected = false;

        //LCD1.AQM0802_display_update("*", 1, 0, NULL, 0, 0, NO_OPERATION, AQM0802_L1);

        now_free_heap_size = ESP.getFreeHeap();
        Serial.printf_P(PSTR("[i] Free Heap  size: %d\r\n"), (int)now_free_heap_size);   
      }
    break;

    case WIFI_WAIT_PROCESS:
      if(wait_time <= WiFi_wait_counter)
          WiFi_state = WiFi_next_state;
    break;     

    default:
    break;
  }
}



/**
 * @brief TaskScheduler コールバック関数
 *        １ｍｓ 間隔で実行される
 * アプリメイン処理
 */
void MainWork_Callback(void)
{
  if(f_counter_trigger)
  {

    f_counter_trigger = false;
  }

  //ＳＷ２ボタンフラグ確認（押下）
  if(0 != (f_FE_SignalDetect & SW2_ISOIN1))
  { //ＳＷ２が押下された
    Serial.printf_P(PSTR("[D] TASK: MainWork Proc (SW2[ISO IN1] ON...)\r\n"));
    digitalWrite(BUZZER_PIN, HIGH); //BuzzerをON

    f_FE_SignalDetect &= ~SW2_ISOIN1;   //SW2_ISOIN1 フラグクリア
  }
  //ＳＷ２ボタンフラグ確認（離上）
  if(0 != (f_RE_SignalDetect & SW2_ISOIN1))
  { //ＳＷ２が離された
    //Serial.printf_P(PSTR("TASK: MainWork Proc (SW2[ISO IN1] OFF..)\r\n"));
    digitalWrite(BUZZER_PIN, LOW);  //BuzzerをOFF

    act_mode++;
    if(3 < act_mode)
      act_mode = 0;

    Serial.printf_P(PSTR("[D] Action mode %d\r\n"), (int)act_mode);


    f_RE_SignalDetect &= ~SW2_ISOIN1;   //SW2_ISOIN1 フラグクリア
  }

    //絶縁入力２　フラグ確認
  if(0 != (f_FE_SignalDetect & ISOIN2))
  { //絶縁入力２　ＯＮ
    Serial.printf_P(PSTR("[D] TASK: MainWork Proc (ISO IN2 ON...)\r\n"));

    f_FE_SignalDetect &= ~ISOIN2;   //ISOIN2 フラグクリア
  }
  //絶縁入力２　フラグ確認
  if(0 != (f_RE_SignalDetect & ISOIN2))
  { //絶縁入力２　ＯＦＦ
    Serial.printf_P(PSTR("[D] TASK: MainWork Proc (ISO IN2 OFF..)\r\n"));

    f_RE_SignalDetect &= ~ISOIN2;   //ISOIN2 フラグクリア
  }

  static uint8_t state = 0;
  static uint8_t ret_state = 0;
  switch(state)
  {
    static bool time_sync_start = false;
    static uint8_t prv_act_mode = 0;
    static uint16_t gl_cnt1 = 0;
    static uint16_t wait_count = 0;

