rinwado/esp8266_sample-i2c_ioexp/src/main.cpp
    static bool f_request_adc = false;
    static int16_t data[4][1024] = {0};
    static int volt_mv[4] = {0};
    static uint8_t adc_ch = 0;
    static int data_cnt = 0;

    
    case 0:
      //アイドル
      if(prv_act_mode != act_mode)
      {
        if(3 == prv_act_mode)
        { for(int8_t r=0; r<8; r++) tca9534_ioport[r] = SET_OFF;
          exp_gpio.digitalWrite(tca9534_ioport);
        }

        if(1 == prv_act_mode)
        { Serial.printf_P(PSTR("[D] TASK: MainWork Proc (Sync NTP Server...)\r\n")); 
          time_sync_start = true;
        }

        if(0 == prv_act_mode)
        { Serial.printf_P(PSTR("[D] Starting 4-channel ADC at 128sps. Will take approximately 40sec.\r\n")); 
          data_cnt = 0;
          adc_ch = 0;
          memset((void*)data, 0, sizeof(data));
          f_request_adc = false;
        }
        
        prv_act_mode = act_mode;
        ret_state = act_mode;
        gl_cnt1 = 0;
        wait_count = 2000;
        state = 100;
      }
      else
      { state = ret_state;
      }
    break;

    case 1:
      //state0 を回って戻ってくるので、約２ｍｓ間隔で処理
/*
      gl_cnt1++;
      if(1500 <= gl_cnt1)  //state0 を回って戻ってくるので、カウンタは約２ｍｓでカウント
      { Serial.printf_P(PSTR("[D] TASK: MainWork Proc (act. mode %d)\r\n"), (int)act_mode);
        gl_cnt1 = 0;
      }
*/
      if(f_ads_available)
      {

        if(f_request_adc)
        { //ADC要求完了
          if(ADS.isReady())
          { data[(int)adc_ch][data_cnt] = ADS.getValue();
            if(3 <= adc_ch)
            { data_cnt++;
              adc_ch = 0;
            }
            else
            {
              adc_ch++;
            }
            f_request_adc = false;
          }
        }
        else
        { //ADC要求
          if(1024 > data_cnt)
          { //データサンプリング
            ADS.setGain(1);     //ADS1X15_PGA_4_096V
            ADS.setMode(1);     //ADS1X15_MODE_ONCE
            ADS.setDataRate(4); //ADS1X15_DATARATE_4
            ADS.requestADC(adc_ch);
            f_request_adc = true;
          }
          else
          { //データ表示
            int r;
            float f;
            f = ADS.toVoltage(1) * 1000.0F;  //voltage factor x1000　でｍV
            for(r=0; r<1024; r++)
            {
              volt_mv[0] = (int)(((float)data[0][r] * f) + 0.5F);
              volt_mv[1] = (int)(((float)data[1][r] * f) + 0.5F);
              volt_mv[2] = (int)(((float)data[2][r] * f) + 0.5F);
              volt_mv[3] = (int)(((float)data[3][r] * f) + 0.5F);
              Serial.printf_P(PSTR("[G] D[%04d]-CH0..3: %06d, %06d, %06d, %06d\r\n"), r, volt_mv[0], volt_mv[1], volt_mv[2], volt_mv[3]);
            }
            data_cnt = 0;
            adc_ch = 0;
            memset((void*)data, 0, sizeof(data));
            f_request_adc = false;
            Serial.printf_P(PSTR("[D] Starting 4-channel ADC at 128sps. Will take approximately 40sec.\r\n")); 
          }
        }
      }


      ret_state = state;
      state = 0;
    break;

    case 2:
      //RTC 時刻同期 処理
      //state0 を回って戻ってくるので、約２ｍｓ間隔で処理
      if(f_wifi_connected)
      {
        if(time_sync_start)
        { //時刻同期
          if(NTP_client->update())  //時刻をサーバーに問合せ。update()は、最大６０秒１回なので同期されるまで最大で６０秒待たされる。
          { //サーバーと同期がとれた
            time_t epoch = NTP_client->getEpochTime(); 
            p_timeInfo = localtime(&epoch);

            char ampm[4];

            RTC.s3539x_times.hour24 = true;
            if((0 <= p_timeInfo->tm_hour) && (12 > p_timeInfo->tm_hour))
              RTC.s3539x_times.aml_pmh = false;
            else
              RTC.s3539x_times.aml_pmh = true;

            RTC.s3539x_times.week   = RTC.int_to_BCD((uint16_t)p_timeInfo->tm_wday);
            RTC.s3539x_times.year   = RTC.int_to_BCD((uint16_t)(p_timeInfo->tm_year - 100)); //+1900-2000=-100
            RTC.s3539x_times.month  = RTC.int_to_BCD((uint16_t)(p_timeInfo->tm_mon + 1));
            RTC.s3539x_times.date   = RTC.int_to_BCD((uint16_t)p_timeInfo->tm_mday);
            RTC.s3539x_times.hour   = RTC.int_to_BCD((uint16_t)p_timeInfo->tm_hour);
            RTC.s3539x_times.minute = RTC.int_to_BCD((uint16_t)p_timeInfo->tm_min);
            RTC.s3539x_times.second = RTC.int_to_BCD((uint16_t)p_timeInfo->tm_sec);

            if(S3539x_SUCCESS == RTC.set_time(&RTC.s3539x_times))
            {   if(RTC.s3539x_times.aml_pmh) strcpy(ampm, "PM"); else strcpy(ampm, "AM");
                Serial.printf_P(PSTR("[S] Sync time > %d-%02d-%02d(%s) %s %02d:%02d:%02d\r\n\r\n"),
                    RTC.s3539x_times.year_four_digit,
                    (int)RTC.BCD_to_int(RTC.s3539x_times.month),
                    (int)RTC.BCD_to_int(RTC.s3539x_times.date),
                    (char*)(&RTC.weeks[RTC.s3539x_times.week][0]),
                    ampm,
                    (int)RTC.BCD_to_int((uint8_t)(RTC.s3539x_times.hour & (uint8_t)(~AMPM_BIT))),
                    (int)RTC.BCD_to_int(RTC.s3539x_times.minute),
                    (int)RTC.BCD_to_int(RTC.s3539x_times.second) 
                    );
            }
            else
            {   Serial.printf_P(PSTR("[e] Set time Command, exec error!!\r\n\r\n"));
            }
            time_sync_start = false;
            Serial.printf_P(PSTR("\r\n[D] TASK: MainWork Proc (Re-sync Success!) EpochTime=%u\r\n"), epoch);
          }
        }
      }

      gl_cnt1++;
      if(time_sync_start)
      {
        if(1500 <= gl_cnt1)  //state0 を回って戻ってくるので、カウンタは約２ｍｓでカウント
        { Serial.printf_P(PSTR("[D] TASK: MainWork Proc (Please wait until the time is synchronized with the NTP server.)\r\n"));
          gl_cnt1 = 0;
        }
      }
      else
      {
        if(500 <= gl_cnt1)  //state0 を回って戻ってくるので、カウンタは約２ｍｓでカウント
        { int ret = RTC.get_time(&RTC.s3539x_times);
          if(S3539x_SUCCESS == ret)
          { //成功
            Serial.printf_P(PSTR("[i] S-35390A Time [%s/%s] %d/%02X/%02X(%s) %02X:%02X:%02X\r\n"),
            (RTC.s3539x_times.hour24)? "24h" : "12h", (RTC.s3539x_times.aml_pmh)? "PM" : "AM",
            RTC.s3539x_times.year_four_digit, RTC.s3539x_times.month, RTC.s3539x_times.date, (char*)(&RTC.weeks[RTC.s3539x_times.week][0]),
            (uint8_t)(RTC.s3539x_times.hour&0x3F), RTC.s3539x_times.minute, RTC.s3539x_times.second);        
          }
          else
          { //失敗
            Serial.printf_P(PSTR("[e] S-35390A Get Time error(%d)!\r\n"), ret);
          }
          gl_cnt1 = 0;
        }
      }

      state = 0;
      ret_state = act_mode;
    break;

    case 3:
      //リレー接点リフレッシュ
      gl_cnt1++;
      if(50 <= gl_cnt1)  //state0 を回って戻ってくるので、カウンタは約２ｍｓでカウント
      { 
        if(f_tca9534_available)
        {
          for(int8_t r=0; r<8; r++)
            tca9534_ioport[r] = !tca9534_ioport[r];
          exp_gpio.digitalWrite(tca9534_ioport);
        }
        gl_cnt1 = 0;
      }

      state = 0;
      ret_state = act_mode;
    break;


