rinwado/esp8266_sample-i2c_ioexp/src/main.cpp
    case 100:
      wait_count--;
      if(0 == wait_count)
      { state = ret_state;
      }
      else
      { if(prv_act_mode != act_mode)
          state = 0;
      }
    break;

    default:
      state = 0;
    break;
  }
}



/**
 * @brief ワンショット処理タスク
 *        ティックタイマー割込みの「リスタート」で処理が行われる
 *        処理が終わるとタスクは、disable（休止状態）
 */
void TskOneShot_ProcCallback(void)
{
  static uint8_t ld4_cnt = 0;
  
  if(0 == act_mode)
  {
    static uint8_t gl_cnt100 = 0;

    if(f_tca9534_available && (!(gl_cnt100 & 0x03)))
    {
      //リレー動作
      if(tca9534_ioport[RL1_DRV])
      {
        tca9534_ioport[RL1_DRV] = SET_OFF;
        tca9534_ioport[RL1LED_DRV] = SET_OFF;
      }
      else
      {
        tca9534_ioport[RL1_DRV] = SET_ON;
        tca9534_ioport[RL1LED_DRV] = SET_ON;      
      }
      exp_gpio.digitalWrite(tca9534_ioport);

      //時刻表示
      int ret = RTC.get_time(&RTC.s3539x_times);
      if(S3539x_SUCCESS == ret)
      { //成功
        Serial.printf_P(PSTR("S-35390A Time [%s/%s] %d/%02X/%02X(%s) %02X:%02X:%02X\r\n"),
        (RTC.s3539x_times.hour24)? "24h" : "12h", (RTC.s3539x_times.aml_pmh)? "PM" : "AM",
        RTC.s3539x_times.year_four_digit, RTC.s3539x_times.month, RTC.s3539x_times.date, (char*)(&RTC.weeks[RTC.s3539x_times.week][0]),
        (uint8_t)(RTC.s3539x_times.hour&0x3F), RTC.s3539x_times.minute, RTC.s3539x_times.second);        
      }
      else
      { //失敗
        Serial.printf_P(PSTR("[e] S-35390A Get Time error(%d)!\r\n"), ret);
      }
    }

    gl_cnt100++;
  }

  digitalWrite(LED_LD4, (ld4_cnt & 0x01));  // LEDを点滅
  ld4_cnt++;
}


/**
 * @brief ティッカーによる割込み処理
 *        3.333mS ごとに処理
 *        ここには長い処理やdelay()などは書かない、１ｍｓ以下で処理が完了するような内容が望ましい
 */
void IRAM_ATTR onTickTimerISR(void)
{
  static uint8_t Signal_Filter[14] = {0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF};
  static uint8_t IO_SignalMonitorVal = 0x00;
  static uint8_t re, fe;
  static int8_t  r, ssv;
  
  //信号サンプリング
  IO_SignalMonitorVal = (0 != digitalRead(IO0_PIN))?  (IO_SignalMonitorVal | SW2_ISOIN1)  : (IO_SignalMonitorVal & ~SW2_ISOIN1);  //IO0 (sw2 button, ISO-IN1)
  IO_SignalMonitorVal = (0 != digitalRead(IO2_PIN))?  (IO_SignalMonitorVal | ISOIN2)      : (IO_SignalMonitorVal & ~ISOIN2);      //IO2 (ISO-IN2)
  //フィルターと信号安定チェック
  ssv = 0;
  for(r=11; r>0; r--)
  { Signal_Filter[r] = Signal_Filter[r-1];              //データシフト
    if(Signal_Filter[r] != IO_SignalMonitorVal) ssv++;  //最新データと異なっていたらカウントアップ
  }
  Signal_Filter[r] = IO_SignalMonitorVal;               //最新データ

  if(0 == ssv)
  {	//信号サンプリングデータが１２連続(3.333ms x 12 = 40ms)同じ安定
      //信号 ON/OFF エッジ抽出
      Signal_Filter[13] = ~Signal_Filter[12];
      Signal_Filter[12] = Signal_Filter[11];
      fe = ~(Signal_Filter[13] | Signal_Filter[12]);    //信号の立下がりエッジ検出
      re =   Signal_Filter[13] & Signal_Filter[12];     //信号の立上がりエッジ検出

      if((fe != 0x00) || (re != 0x00))
      {	//立下り、立ち上がりの変化あり
          //信号　変化(H -> L)
          if(0 != (fe & SW2_ISOIN1))     f_FE_SignalDetect |= SW2_ISOIN1;     //bit0:
          if(0 != (fe & ISOIN2))         f_FE_SignalDetect |= ISOIN2;         //bit1:

          //信号　変化(L -> H)
          if(0 != (re & SW2_ISOIN1))     f_RE_SignalDetect |= SW2_ISOIN1;     //bit0:
          if(0 != (re & ISOIN2))         f_RE_SignalDetect |= ISOIN2;         //bit1:
      }
  }

  //-----
  gn_cnt1++;
  if(300 <= gn_cnt1)
  { //main_work 用のトリガフラグ (1000ms)
    gn_cnt1 = 0;
    f_counter_trigger = true;
  }
  //-----
  gn_cnt2++;
  if(150 <= gn_cnt2)
  { //ワンショット処理タスク (500ms)
    gn_cnt2 = 0;
    tsk_OneShot_01.restart();
  }

  //-----
  WiFi_wait_counter++;
  WiFi_ConnectTimeOut_Counter--;

}
